Repository: HyD-Inc/python-doc-bn
Catalog: tutorial/appetite.po
Languages: bn

source: Whetting Your Appetite
bn: আপনার জানার আসক্তি নিবারণ

source: If you do much work on computers, eventually you find that there's some task you'd like to automate. For example, you may wish to perform a search-and-replace over a large number of text files, or rename and rearrange a bunch of photo files in a complicated way. Perhaps you'd like to write a small custom database, or a specialized GUI application, or a simple game.
bn: আপনি যদি কম্পিউটার নিয়ে অনেক বেশি কাজ করে থাকেন,অবশেষে আপনি এমন কিছু কাজ খুঁজে পাবেন যেগুলো আপনি স্বয়ংক্রিয় (automate) করতে চাইবেন। দৃষ্টান্তস্বরূপ, আপনি হয়তো চাচ্ছেন অনেক বড় একটি লেখার পরিবর্তে সার্চ অ্যান্ড রিপ্লেস (অনুসন্ধান এবং প্রতিস্থাপন) করতে, অথবা পুনঃ নামকরণ এবং এক গুচ্ছ ছবির ফাইল কে একটু জটিল ভাবে সাজাতে। সম্ভবত আপনি আরও চাচ্ছেন একটি ছোট কাস্টম ডাটাবেস লিখতে, অথবা বিশেষ কোন GUI অ্যাপ্লিকেশান ,এমনকি একটি সাধারণ গেম তৈরি করতে।

source: If you're a professional software developer, you may have to work with several C/C++/Java libraries but find the usual write/compile/test/re-compile cycle is too slow. Perhaps you're writing a test suite for such a library and find writing the testing code a tedious task. Or maybe you've written a program that could use an extension language, and you don't want to design and implement a whole new language for your application.
bn: যদি আপনি একজন পেশাদার সফটওয়্যার ডেভেলপার হন, আপনাকে হয়তো সি/ সি++/জাভা লাইব্রেরি নিয়ে কাজ করা লাগতে পারে কিন্তু সাধারণ লেখা/ কম্পাইল করা/ পরীক্ষা/ পুনঃ কম্পাইল সাইকেল খুঁজে বের করা খুব ধীরগতির হতে পারে।সম্ভবত আপনি কোন লাইব্রেরির জন্য টেস্ট স্যুট লিখছেন এবং বুঝতে পারলেন যে টেস্টিং কোড লেখাটা একটা বিরক্তিকর কাজ।এমনকি হয়তো আপনি এক্সটেন্সান ল্যাঙ্গুয়েজ ব্যাবহার করে একটি প্রোগ্রাম লিখলেন, এবং যার জন্য আপনি সম্পূর্ণ একটি নতুন ল্যাঙ্গুয়েজ সাজাতে এবং বাস্তবায়ন করতে চান না।

source: Python is just the language for you.
bn: তাহলে পাইথন ল্যাঙ্গুয়েজ টা আপনার ই জন্য।

source: You could write a Unix shell script or Windows batch files for some of these tasks, but shell scripts are best at moving around files and changing text data, not well-suited for GUI applications or games. You could write a C/C++/Java program, but it can take a lot of development time to get even a first-draft program. Python is simpler to use, available on Windows, macOS, and Unix operating systems, and will help you get the job done more quickly.
bn: আপনি এই কাজগুলির কিছু জন্য একটি ইউনিক্স শেল স্ক্রিপ্ট বা উইন্ডোজ ব্যাচ ফাইল লিখতে পারেন, তবে শেল স্ক্রিপ্টগুলি ফাইলগুলির চারপাশে ঘোরাফেরা করতে এবং পাঠ্য ডেটা পরিবর্তন করতে সর্বোত্তম, জিইউই অ্যাপ্লিকেশন বা গেমগুলির জন্য উপযুক্ত নয়। আপনি একটি সি/সি++/জাভা প্রোগ্রাম লিখতে পারেন, তবে এমনকি প্রথম খসড়া প্রোগ্রাম পেতে অনেক উন্নয়ন সময় লাগতে পারে। পাইথন ব্যবহার করা সহজ, উইন্ডোজ, ম্যাকওএস এবং ইউনিক্স অপারেটিং সিস্টেমে উপলব্ধ, এবং আপনাকে আরও দ্রুত কাজটি সম্পন্ন করতে সহায়তা করবে।

source: Python is simple to use, but it is a real programming language, offering much more structure and support for large programs than shell scripts or batch files can offer. On the other hand, Python also offers much more error checking than C, and, being a *very-high-level language*, it has high-level data types built in, such as flexible arrays and dictionaries. Because of its more general data types Python is applicable to a much larger problem domain than Awk or even Perl, yet many things are at least as easy in Python as in those languages.
bn: পাইথন ব্যবহার করা সহজ, কিন্তু এটি একটি বাস্তব প্রোগ্রামিং ভাষা, শেল স্ক্রিপ্ট বা ব্যাচ ফাইল অফার করতে পারে চেয়ে বড় প্রোগ্রামের জন্য অনেক বেশি কাঠামো এবং সমর্থন প্রদান করে। অন্যদিকে, পাইথন সি-এর চেয়ে অনেক বেশি ত্রুটি পরীক্ষা করে, এবং * খুব উচ্চ স্তরের ভাষা* হওয়ায়, এটিতে উচ্চ স্তরের ডেটা টাইপ তৈরি করা হয়েছে, যেমন নমনীয় ( ফ্লেক্সিবল ) অ্যারে এবং অভিধান। এর বেশি সাধারণ ডেটা ধরণের কারণে পাইথন Awk বা এমনকি Perl চেয়ে অনেক বড় সমস্যা ডোমেইনের জন্য প্রযোজ্য, তবুও পাইথনে অনেক কিছুই অন্তত সেই ভাষাগুলির মতো সহজ।

source: Python allows you to split your program into modules that can be reused in other Python programs. It comes with a large collection of standard modules that you can use as the basis of your programs --- or as examples to start learning to program in Python. Some of these modules provide things like file I/O, system calls, sockets, and even interfaces to graphical user interface toolkits like Tk.
bn: পাইথন আপনাকে আপনার প্রোগ্রামকে মডিউলগুলিতে বিভক্ত করতে দেয় যা অন্যান্য পাইথন প্রোগ্রামগুলিতে পুনরায় ব্যবহার করা যেতে পারে। এটি স্ট্যান্ডার্ড মডিউলগুলির একটি বড় সংগ্রহ নিয়ে আসে যা আপনি আপনার প্রোগ্রামগুলির ভিত্তি হিসাবে ব্যবহার করতে পারেন --- বা পাইথনে প্রোগ্রাম শিখতে শুরু করার উদাহরণ হিসাবে। এই মডিউলগুলির মধ্যে কিছু ফাইল আই/ও, সিস্টেম কল, সকেট এবং এমনকি ইন্টারফেসের মতো গ্রাফিকাল ইউজার ইন্টারফেস টুলকিটযেমন টিকে সরবরাহ করে।

source: Python is an interpreted language, which can save you considerable time during program development because no compilation and linking is necessary. The interpreter can be used interactively, which makes it easy to experiment with features of the language, to write throw-away programs, or to test functions during bottom-up program development. It is also a handy desk calculator.
bn: পাইথন একটি ব্যাখ্যাকরা ভাষা (interpreted language) , যা প্রোগ্রাম বিকাশের সময় আপনাকে যথেষ্ট সময় বাঁচাতে পারে কারণ কোনও সংকলন এবং লিঙ্কিং প্রয়োজন । ইন্তারপ্রিটার ইন্টারেক্টিভভাবে ব্যবহার করা যেতে পারে, যা ভাষার বৈশিষ্ট্যগুলি নিয়ে পরীক্ষা করা, থ্রো-অ্যাওয়ে প্রোগ্রাম গুলি লিখতে বা বটম-আপ প্রোগ্রাম বিকাশের সময় ফাংশন পরীক্ষা করা সহজ করে তোলে। এটি একটি সহজ ডেস্ক ক্যালকুলেটরও।

source: Python enables programs to be written compactly and readably. Programs written in Python are typically much shorter than equivalent C, C++, or Java programs, for several reasons:
bn: পাইথন প্রোগ্রামগুলিকে সমন্নিতভাবে এবং পঠনযোগ্যভাবে লিখতে সক্ষম করে। পাইথনে লেখা প্রোগ্রামগুলি সাধারণত সমতুল্য সি, সি++ বা জাভা প্রোগ্রামের চেয়ে অনেক ছোট, বেশ কয়েকটি কারণে:

source: the high-level data types allow you to express complex operations in a single statement;
bn: উচ্চ পর্যায়ের ডেটা প্রকারগুলি আপনাকে একটি বর্ণনাতে জটিল ক্রিয়াকলাপগুলি প্রকাশ করার অনুমতি দেয়;

source: statement grouping is done by indentation instead of beginning and ending brackets;
bn: স্টেটমেন্ট গ্রুপিং শুরু এবং শেষ বন্ধনীর পরিবর্তে ইন্ডেন্টেশন দ্বারা করা হয়;

source: no variable or argument declarations are necessary.
bn: কোনো variable বা যুক্তি ঘোষণার প্রয়োজন নেই।

source: Python is *extensible*: if you know how to program in C it is easy to add a new built-in function or module to the interpreter, either to perform critical operations at maximum speed, or to link Python programs to libraries that may only be available in binary form (such as a vendor-specific graphics library). Once you are really hooked, you can link the Python interpreter into an application written in C and use it as an extension or command language for that application.
bn: পাইথন *এক্সটেনসিবল*: আপনি যদি জানেন কিভাবে সি-তে প্রোগ্রাম করতে হয় তাহলে ইন্টারপ্রেটারে একটি নতুন বিল্ট-ইন ফাংশন বা মডিউল যোগ করা সহজ, হয়ত সর্বোচ্চ গতিতে ক্রিটিকাল অপারেশন করতে, অথবা পাইথন প্রোগ্রামগুলিকে লাইব্রেরির সাথে লিঙ্ক করতে পারে যা শুধুমাত্র বাইনারি আকারে পাওয়া যাবে (যেমন একটি বিক্রেতা-নির্দিষ্ট গ্রাফিক্স লাইব্রেরি)। একবার আপনি সত্যিই হুক হয়ে গেলে, আপনি পাইথন ইন্টারপ্রেটারকে সি তে লেখা একটি অ্যাপ্লিকেশনের সাথে লিঙ্ক করতে পারেন এবং সেই অ্যাপ্লিকেশনটির জন্য একটি এক্সটেনশন বা কমান্ড ভাষা হিসাবে ব্যবহার করতে পারেন।

source: By the way, the language is named after the BBC show "Monty Python's Flying Circus" and has nothing to do with reptiles. Making references to Monty Python skits in documentation is not only allowed, it is encouraged!
bn: যাইহোক, ভাষাটির নামকরণ করা হয়েছে বিবিসি শো "মন্টি পাইথনস ফ্লাইং সার্কাস" এর নামানুসারে এবং সরীসৃপের সাথে এর কোনও সম্পর্ক নেই। ডকুমেন্টেশনে মন্টি পাইথন স্কিটগুলির রেফারেন্স তৈরি করা শুধুমাত্র অনুমোদিত নয়, এটি উত্সাহিত করা হয়!

source: Now that you are all excited about Python, you'll want to examine it in some more detail. Since the best way to learn a language is to use it, the tutorial invites you to play with the Python interpreter as you read.
bn: এখন যেহেতু আপনারা সকলেই পাইথন সম্পর্কে উত্তেজিত, আপনি এটিকে আরও বিস্তারিতভাবে পরীক্ষা করতে চাইবেন। যেহেতু একটি ভাষা শেখার সর্বোত্তম উপায় হল এটি ব্যবহার করা, টিউটোরিয়ালটি আপনাকে পাইথন ইন্টারপ্রিটারের সাথে খেলার জন্য আমন্ত্রণ জানায়।

source: In the next chapter, the mechanics of using the interpreter are explained. This is rather mundane information, but essential for trying out the examples shown later.
bn: পরবর্তী অধ্যায়ে, ইন্টারপ্রিটার ব্যবহারের মেকানিক্স ব্যাখ্যা করা হয়েছে। এটি বরং জাগতিক তথ্য, কিন্তু পরে দেখানো উদাহরণগুলি চেষ্টা করার জন্য অপরিহার্য।

source: The rest of the tutorial introduces various features of the Python language and system through examples, beginning with simple expressions, statements and data types, through functions and modules, and finally touching upon advanced concepts like exceptions and user-defined classes.
bn: বাকি টিউটোরিয়ালটি উদাহরণের মাধ্যমে পাইথন ভাষা এবং সিস্টেমের বিভিন্ন বৈশিষ্ট্যের সাথে পরিচয় করিয়ে দেয়, সহজ অভিব্যক্তি (এক্সপ্রেশন) , বিবৃতি এবং ডেটা টাইপ দিয়ে শুরু করে, ফাংশন এবং মডিউলগুলির মাধ্যমে এবং অবশেষে ব্যতিক্রম এবং ইউজার ডিফাইন ক্লাসের মতো উন্নত ধারণাগুলিকে স্পর্শ করে।
