Repository: HyD-Inc/python-doc-bn
Catalog: tutorial/appendix.po
Languages: bn

source: Appendix
bn: পরিশিষ্ট

source: Interactive Mode
bn: ইন্টারেক্টিভ মোড

source: Error Handling
bn: ত্রুটি পরিচালনা

source: When an error occurs, the interpreter prints an error message and a stack trace. In interactive mode, it then returns to the primary prompt; when input came from a file, it exits with a nonzero exit status after printing the stack trace. (Exceptions handled by an :keyword:`except` clause in a :keyword:`try` statement are not errors in this context.) Some errors are unconditionally fatal and cause an exit with a nonzero exit; this applies to internal inconsistencies and some cases of running out of memory. All error messages are written to the standard error stream; normal output from executed commands is written to standard output.
bn: যখন একটি ত্রুটি ঘটে, তখন দোভাষী একটি ত্রুটি বার্তা এবং একটি স্ট্যাক ট্রেস প্রিন্ট করে। ইন্টারেক্টিভ মোডে, এটি তারপর প্রাথমিক প্রম্পটে ফিরে আসে; যখন একটি ফাইল থেকে ইনপুট আসে, স্ট্যাক ট্রেস প্রিন্ট করার পরে এটি একটি অশূন্য প্রস্থান অবস্থা সহ প্রস্থান করে। (একটি :কীওয়ার্ড:`ব্যতীত` ধারা :কীওয়ার্ড:`ট্রাই` বিবৃতিতে যে ব্যতিক্রমগুলি পরিচালনা করা হয়েছে তা এই প্রসঙ্গে ত্রুটি নয়।)কিছু ত্রুটি শর্তহীনভাবে মারাত্মক এবং একটি অশূন্য প্রস্থান সহ একটি প্রস্থান ঘটায়; এটি অভ্যন্তরীণ অসঙ্গতি এবং মেমরি ফুরিয়ে যাওয়ার কিছু ক্ষেত্রে প্রযোজ্য।সমস্ত ত্রুটি বার্তা স্ট্যান্ডার্ড ত্রুটি স্ট্রীমে লেখা হয়; এক্সিকিউটেড কমান্ড থেকে সাধারণ আউটপুট স্ট্যান্ডার্ড আউটপুটে লেখা হয়।

source: Typing the interrupt character (usually :kbd:`Control-C` or :kbd:`Delete`) to the primary or secondary prompt cancels the input and returns to the primary prompt. [#]_ Typing an interrupt while a command is executing raises the :exc:`KeyboardInterrupt` exception, which may be handled by a :keyword:`try` statement.
bn: প্রাইমারি বা সেকেন্ডারি প্রম্পটে ইন্টারাপ্ট ক্যারেক্টার (সাধারণত :kbd:`Control-C` বা :kbd:`Delete`) টাইপ করা ইনপুট বাতিল করে এবং প্রাথমিক প্রম্পটে ফিরে আসে।[#] _ একটি কমান্ড কার্যকর করার সময় একটি বাধা টাইপ করলে :exc:`KeyboardInterrupt` ব্যতিক্রম দেখা যায়, যা একটি :keyword:`try` বিবৃতি দ্বারা পরিচালিত হতে পারে।

source: Executable Python Scripts
bn: এক্সিকিউটেবল পাইথন স্ক্রিপ্ট

source: On BSD'ish Unix systems, Python scripts can be made directly executable, like shell scripts, by putting the line ::
bn: BSD'ish ইউনিক্স সিস্টেমে, পাইথন স্ক্রিপ্টগুলিকে সরাসরি এক্সিকিউটেবল করা যেতে পারে, শেল স্ক্রিপ্টের মতো, লাইনটি বসিয়ে ::

source: (assuming that the interpreter is on the user's :envvar:`PATH`) at the beginning of the script and giving the file an executable mode. The ``#!`` must be the first two characters of the file. On some platforms, this first line must end with a Unix-style line ending (``'\n'``), not a Windows (``'\r\n'``) line ending. Note that the hash, or pound, character, ``'#'``, is used to start a comment in Python.
bn: (ধরে নিচ্ছি যে দোভাষীটি ব্যবহারকারীর :envvar:`PATH` এ) স্ক্রিপ্টের শুরুতে এবং ফাইলটিকে একটি এক্সিকিউটেবল মোড দেয়।``#!`` ফাইলটির প্রথম দুটি অক্ষর হতে হবে।কিছু প্ল্যাটফর্মে, এই প্রথম লাইনটি অবশ্যই ইউনিক্স-শৈলীর লাইনের সমাপ্তি (``'\n'``) দিয়ে শেষ হওয়া উচিত, উইন্ডোজ (``'\r\n'``) লাইনের শেষ নয়।মনে রাখবেন যে হ্যাশ, বা পাউন্ড, অক্ষর, ``'#'``, পাইথনে একটি মন্তব্য শুরু করতে ব্যবহৃত হয়।

source: The script can be given an executable mode, or permission, using the :program:`chmod` command.
bn: :program:`chmod` কমান্ড ব্যবহার করে স্ক্রিপ্টটিকে একটি এক্সিকিউটেবল মোড বা অনুমতি দেওয়া যেতে পারে।

source: On Windows systems, there is no notion of an "executable mode". The Python installer automatically associates ``.py`` files with ``python.exe`` so that a double-click on a Python file will run it as a script. The extension can also be ``.pyw``, in that case, the console window that normally appears is suppressed.
bn: উইন্ডোজ সিস্টেমে, "এক্সিকিউটেবল মোড" এর কোন ধারণা নেই।পাইথন ইনস্টলার স্বয়ংক্রিয়ভাবে ``.py`` ফাইলগুলিকে ``python.exe``-এর সাথে সংযুক্ত করে যাতে একটি Python ফাইলে ডাবল-ক্লিক করলে এটি একটি স্ক্রিপ্ট হিসেবে চলবে।এক্সটেনশনটি ``.pyw``ও হতে পারে, সেক্ষেত্রে সাধারণত যে কনসোল উইন্ডোটি দেখা যায় সেটি চাপা থাকে।

source: The Interactive Startup File
bn: ইন্টারেক্টিভ স্টার্টআপ ফাইল

source: When you use Python interactively, it is frequently handy to have some standard commands executed every time the interpreter is started. You can do this by setting an environment variable named :envvar:`PYTHONSTARTUP` to the name of a file containing your start-up commands. This is similar to the :file:`.profile` feature of the Unix shells.
bn: আপনি যখন ইন্টারেক্টিভভাবে পাইথন ব্যবহার করেন, প্রতিবার ইন্টারপ্রেটার শুরু করার সময় কিছু স্ট্যান্ডার্ড কমান্ড কার্যকর করা প্রায়শই সহজ। আপনি আপনার স্টার্ট-আপ কমান্ড ধারণকারী ফাইলের নামের সাথে :envvar:`PYTHONSTARTUP` নামের একটি পরিবেশ পরিবর্তনশীল সেট করে এটি করতে পারেন। এটি ইউনিক্স শেলগুলির :file:`.profile` বৈশিষ্ট্যের অনুরূপ।

source: This file is only read in interactive sessions, not when Python reads commands from a script, and not when :file:`/dev/tty` is given as the explicit source of commands (which otherwise behaves like an interactive session). It is executed in the same namespace where interactive commands are executed, so that objects that it defines or imports can be used without qualification in the interactive session. You can also change the prompts ``sys.ps1`` and ``sys.ps2`` in this file.
bn: এই ফাইলটি শুধুমাত্র ইন্টারেক্টিভ সেশনে পঠিত হয়, যখন পাইথন কোনো স্ক্রিপ্ট থেকে কমান্ড পড়ে তখন নয়, এবং যখন :file:`/dev/tty` কমান্ডের সুস্পষ্ট উৎস হিসেবে দেওয়া হয় (যা অন্যথায় একটি ইন্টারেক্টিভ সেশনের মতো আচরণ করে)। এটি একই নামস্থানে কার্যকর করা হয় যেখানে ইন্টারেক্টিভ কমান্ডগুলি কার্যকর করা হয়, যাতে এটি যে বস্তুগুলিকে সংজ্ঞায়িত করে বা আমদানি করে সেগুলি ইন্টারেক্টিভ সেশনে যোগ্যতা ছাড়াই ব্যবহার করা যেতে পারে।এছাড়াও আপনি এই ফাইলে ``sys.ps1`` এবং ``sys.ps2`` প্রম্পট পরিবর্তন করতে পারেন।

source: If you want to read an additional start-up file from the current directory, you can program this in the global start-up file using code like ``if os.path.isfile('.pythonrc.py'): exec(open('.pythonrc.py').read())``. If you want to use the startup file in a script, you must do this explicitly in the script::
bn: আপনি যদি বর্তমান ডিরেক্টরি থেকে একটি অতিরিক্ত স্টার্ট-আপ ফাইল পড়তে চান, তাহলে আপনি ``if os.path.isfile('.pythonrc.py'): exec(open) এর মতো কোড ব্যবহার করে গ্লোবাল স্টার্ট-আপ ফাইলে এটি প্রোগ্রাম করতে পারেন ('.pythonrc.py').read())``। আপনি যদি একটি স্ক্রিপ্টে স্টার্টআপ ফাইলটি ব্যবহার করতে চান তবে আপনাকে অবশ্যই এটি স্ক্রিপ্টে স্পষ্টভাবে করতে হবে::

source: The Customization Modules
bn: কাস্টমাইজেশন মডিউল

source: Python provides two hooks to let you customize it: :mod:`sitecustomize` and :mod:`usercustomize`. To see how it works, you need first to find the location of your user site-packages directory. Start Python and run this code::
bn: পাইথন আপনাকে কাস্টমাইজ করার জন্য দুটি হুক প্রদান করে: :mod:`sitecustomize` এবং :mod:`usercustomize`। এটি কিভাবে কাজ করে তা দেখতে, আপনাকে প্রথমে আপনার ব্যবহারকারী সাইট-প্যাকেজ ডিরেক্টরির অবস্থান খুঁজে বের করতে হবে। পাইথন শুরু করুন এবং এই কোডটি চালান::

source: Now you can create a file named :file:`usercustomize.py` in that directory and put anything you want in it. It will affect every invocation of Python, unless it is started with the :option:`-s` option to disable the automatic import.
bn: এখন আপনি সেই ডিরেক্টরিতে :file:`usercustomize.py` নামে একটি ফাইল তৈরি করতে পারেন এবং এতে আপনি যা চান তা রাখতে পারেন। এটি পাইথনের প্রতিটি আহ্বানকে প্রভাবিত করবে, যদি না এটি স্বয়ংক্রিয় আমদানি নিষ্ক্রিয় করতে :option:`-s` বিকল্প দিয়ে শুরু করা হয়।

source: :mod:`sitecustomize` works in the same way, but is typically created by an administrator of the computer in the global site-packages directory, and is imported before :mod:`usercustomize`. See the documentation of the :mod:`site` module for more details.
bn: :mod:`sitecustomize` একইভাবে কাজ করে, কিন্তু সাধারণত গ্লোবাল সাইট-প্যাকেজ ডিরেক্টরিতে কম্পিউটারের একজন প্রশাসক দ্বারা তৈরি করা হয় এবং :mod:`usercustomize` এর আগে আমদানি করা হয়।আরো বিস্তারিত জানার জন্য :mod:`site` মডিউলের ডকুমেন্টেশন দেখুন।

source: Footnotes
bn: পাদটীকা

source: A problem with the GNU Readline package may prevent this.
bn: GNU রিডলাইন প্যাকেজের সমস্যা এটি প্রতিরোধ করতে পারে।
