Repository: HyD-Inc/python-doc-bn
Catalog: tutorial/interpreter.po
Languages: bn

source: Using the Python Interpreter
bn: পাইথন ইন্টারপ্রেটারের ব্যবহার

source: Invoking the Interpreter
bn: ইন্টারপ্রিটার আহ্বান করা

source: The Python interpreter is usually installed as :file:`/usr/local/bin/python3.10` on those machines where it is available; putting :file:`/usr/local/bin` in your Unix shell's search path makes it possible to start it by typing the command:
bn: পাইথন ইন্টারপ্রিটার সাধারণত :file:`/usr/local/bin/python3.10` হিসাবে ইনস্টল করা হয় যেসব যন্ত্রে তা পর্যাপ্ত থাকে; আপনার ইউনিক্স শেলের অনুসন্ধানের পথে :file:`/usr/local/bin` রাখলে কমান্ড টাইপ করে এটি শুরু করা সম্ভব হয়:

source: to the shell. [#]_ Since the choice of the directory where the interpreter lives is an installation option, other places are possible; check with your local Python guru or system administrator. (E.g., :file:`/usr/local/python` is a popular alternative location.)
bn: শেল থেকে [#] _ যেহেতু ইন্টারপ্রিটার থাকা হল ডিরেক্টরির পছন্দ একটি ইনস্টলেশন বিকল্প,যেখানে অন্যান্য স্থানগুলি সম্ভব; আপনার লোকাল পাইথন গুরু বা সিস্টেম অ্যাডমিনিস্ট্রেটরের সাথে চেক করুন। (যেমন, :file:`/usr/local/python` একটি জনপ্রিয় বিকল্প অবস্থান।)

source: On Windows machines where you have installed Python from the :ref:`Microsoft Store <windows-store>`, the :file:`python3.10` command will be available. If you have the :ref:`py.exe launcher <launcher>` installed, you can use the :file:`py` command. See :ref:`setting-envvars` for other ways to launch Python.
bn: উইন্ডোজ মেশিনে যেখানে আপনি :ref:`Microsoft Store <windows-store>` থেকে Python ইনস্টল করেছেন, সেখানে :file:`python3.10` কমান্ডটি পাওয়া যাবে। আপনার যদি :ref:`py.exe লঞ্চার <launcher>` ইনস্টল করা থাকে, আপনি :file:`py` কমান্ডটি ব্যবহার করতে পারেন। পাইথন চালু করার অন্যান্য উপায়ের জন্য দেখুন :ref:`setting-envvars`।

source: Typing an end-of-file character (:kbd:`Control-D` on Unix, :kbd:`Control-Z` on Windows) at the primary prompt causes the interpreter to exit with a zero exit status. If that doesn't work, you can exit the interpreter by typing the following command: ``quit()``.
bn: প্রাথমিক প্রম্পটে ফাইলের শেষ অক্ষর (:kbd:`Control-D` on Unix, :kbd:`Control-Z` on Windows) টাইপ করার ফলে ইন্টারপ্রিটার শূন্য প্রস্থান অবস্থা সহ প্রস্থান করে। যদি এটি কাজ না করে, আপনি নিম্নলিখিত কমান্ডটি টাইপ করে ইন্টারপ্রিটার থেকে প্রস্থান করতে পারেন: ``quit()``।

source: The interpreter's line-editing features include interactive editing, history substitution and code completion on systems that support the `GNU Readline <https://tiswww.case.edu/php/chet/readline/rltop.html>`_ library. Perhaps the quickest check to see whether command line editing is supported is typing :kbd:`Control-P` to the first Python prompt you get. If it beeps, you have command line editing; see Appendix :ref:`tut-interacting` for an introduction to the keys. If nothing appears to happen, or if ``^P`` is echoed, command line editing isn't available; you'll only be able to use backspace to remove characters from the current line.
bn: ইন্টারপ্রিটারের লাইন-সম্পাদনা বৈশিষ্ট্যগুলির মধ্যে রয়েছে ইন্টারেক্টিভ সম্পাদনা, ইতিহাস প্রতিস্থাপন এবং সিস্টেমে কোড সমাপ্তি যা `GNU রিডলাইন <https://tiswww.case.edu/php/chet/readline/rltop.html>`_ লাইব্রেরি সমর্থন করে। কমান্ড লাইন সম্পাদনা সমর্থিত কিনা তা দেখার জন্য সম্ভবত দ্রুততম হল :kbd:`Control-P` টাইপ করা প্রথম Python প্রম্পটে। এটি বীপ হলে, আপনার কমান্ড লাইন সম্পাদনা আছে; কীগুলির ভূমিকার জন্য Appendix :ref:`tut-interacting` দেখুন। যদি কিছু না ঘটে, বা ``^P`` প্রতিধ্বনিত হয়, কমান্ড লাইন সম্পাদনা সহজলভ্য নয়; আপনি শুধুমাত্র বর্তমান লাইন থেকে অক্ষর সরাতে ব্যাকস্পেস ব্যবহার করতে সক্ষম হবেন।

source: The interpreter operates somewhat like the Unix shell: when called with standard input connected to a tty device, it reads and executes commands interactively; when called with a file name argument or with a file as standard input, it reads and executes a *script* from that file.
bn: ইন্টারপ্রেটার কিছুটা ইউনিক্স শেলের মতো কাজ করে: যখন একটি টিটিআই ডিভাইসের সাথে সংযুক্ত স্ট্যান্ডার্ড ইনপুট দিয়ে কল করা হয়, তখন এটি ইন্টারেক্টিভভাবে কমান্ডগুলি পড়ে এবং কার্যকর করে; যখন একটি ফাইলের নামের আর্গুমেন্ট বা স্ট্যান্ডার্ড ইনপুট হিসাবে একটি ফাইলের সাথে কল করা হয়, তখন এটি সেই ফাইল থেকে একটি *স্ক্রিপ্ট* পড়ে এবং চালায়।

source: A second way of starting the interpreter is ``python -c command [arg] ...``, which executes the statement(s) in *command*, analogous to the shell's :option:`-c` option. Since Python statements often contain spaces or other characters that are special to the shell, it is usually advised to quote *command* in its entirety with single quotes.
bn: ইন্টারপ্রেটার শুরু করার দ্বিতীয় উপায় হল ``পাইথন -সি কমান্ড [আর্গ] ...``, যা *কমান্ড*-এ বিবৃতি(s) চালায়, শেলের :option:`-c` বিকল্পের সাথে সাদৃশ্যপূর্ণ। যেহেতু পাইথন স্টেটমেন্টে প্রায়শই শেলের জন্য বিশেষ স্পেস বা অন্যান্য অক্ষর থাকে, তাই সাধারণত একক উদ্ধৃতি সহ সম্পূর্ণরূপে *কমান্ড* উদ্ধৃত করার পরামর্শ দেওয়া হয়।

source: Some Python modules are also useful as scripts. These can be invoked using ``python -m module [arg] ...``, which executes the source file for *module* as if you had spelled out its full name on the command line.
bn: কিছু পাইথন মডিউল স্ক্রিপ্ট হিসাবেও দরকারী। এগুলিকে ``পাইথন -এম মডিউল [আর্গ] ...`` ব্যবহার করে আহ্বান করা যেতে পারে, যা *মডিউল* এর জন্য সোর্স ফাইলটি চালায় যেন আপনি কমান্ড লাইনে এর পুরো নামটি লিখে রেখেছেন।

source: When a script file is used, it is sometimes useful to be able to run the script and enter interactive mode afterwards. This can be done by passing :option:`-i` before the script.
bn: যখন একটি স্ক্রিপ্ট ফাইল ব্যবহার করা হয়, এটি কখনও কখনও স্ক্রিপ্ট চালানো এবং পরে ইন্টারেক্টিভ মোডে প্রবেশ করতে সক্ষম হওয়া দরকারী। স্ক্রিপ্টের আগে :option:`-i` পার করে এটি করা যেতে পারে।

source: All command line options are described in :ref:`using-on-general`.
bn: সমস্ত কমান্ড লাইন অপশন বর্ণনা করা হয়েছে :ref:`using-on-general`-এ।

source: Argument Passing
bn: আর্গুমেন্ট পাসিং

source: When known to the interpreter, the script name and additional arguments thereafter are turned into a list of strings and assigned to the ``argv`` variable in the ``sys`` module. You can access this list by executing ``import sys``. The length of the list is at least one; when no script and no arguments are given, ``sys.argv[0]`` is an empty string. When the script name is given as ``'-'`` (meaning standard input), ``sys.argv[0]`` is set to ``'-'``. When :option:`-c` *command* is used, ``sys.argv[0]`` is set to ``'-c'``. When :option:`-m` *module* is used, ``sys.argv[0]`` is set to the full name of the located module. Options found after :option:`-c` *command* or :option:`-m` *module* are not consumed by the Python interpreter's option processing but left in ``sys.argv`` for the command or module to handle.
bn: যখন ইন্টারপ্রিটারের কাছে পরিচিত হয়, তখন স্ক্রিপ্টের নাম এবং অতিরিক্ত আর্গুমেন্টগুলিকে স্ট্রিংগুলির একটি তালিকায় পরিণত করা হয় এবং ``sys`` মডিউলের ``argv`` ভেরিয়েবলে বরাদ্দ করা হয়।আপনি ``import sys`` সম্পাদন করে এই তালিকাটি অ্যাক্সেস করতে পারেন।তালিকার দৈর্ঘ্য কমপক্ষে একটি; যখন কোনো স্ক্রিপ্ট এবং কোনো আর্গুমেন্ট দেওয়া হয় না, ``sys.argv[0]`` একটি খালি স্ট্রিং। যখন স্ক্রিপ্টের নাম ``'-'`` (অর্থাৎ স্ট্যান্ডার্ড ইনপুট) হিসাবে দেওয়া হয়, ``sys.argv[0]`` সেট করা হয় ``'-'``। যখন :option:`-c` *কমান্ড* ব্যবহার করা হয়, ``sys.argv[0]`` ``'-c'`` এ সেট করা হয়। যখন :option:`-m` *মডিউল* ব্যবহার করা হয়, ``sys.argv[0]`` অবস্থিত মডিউলের পুরো নামে সেট করা হয়।:option:`-c` *কমান্ড* বা :option:`-m` *মডিউল* এর পরে পাওয়া বিকল্পগুলি পাইথন ইন্টারপ্রেটারের অপশন প্রসেসিং দ্বারা বাদ দেয়া হয় না কিন্তু কমান্ড বা মডিউল পরিচালনার জন্য ``sys.argv``-এ রেখে দেওয়া হয়।

source: Interactive Mode
bn: ইন্টারেক্টিভ মোড

source: When commands are read from a tty, the interpreter is said to be in *interactive mode*. In this mode it prompts for the next command with the *primary prompt*, usually three greater-than signs (``>>>``); for continuation lines it prompts with the *secondary prompt*, by default three dots (``...``). The interpreter prints a welcome message stating its version number and a copyright notice before printing the first prompt:
bn: খন একটি টিটিআই থেকে কমান্ড পড়া হয়, তখন ইন্টারপ্রেটারকে *ইন্টারেক্টিভ মোড* বলা হয়। এই মোডে এটি *প্রাথমিক প্রম্পট* সহ পরবর্তী কমান্ডের জন্য প্রম্পট করে, সাধারণত তিনটি গ্রেটার-দেন চিহ্নের (``>>>``); ধারাবাহিকতা লাইনের জন্য এটি *সেকেন্ডারি প্রম্পট* এর সাথে প্রম্পট করে, ডিফল্টভাবে তিনটি বিন্দু (``...``)। দোভাষী প্রথম প্রম্পট প্রিন্ট করার আগে তার সংস্করণ নম্বর এবং একটি কপিরাইট নোটিশ উল্লেখ করে একটি শুভেচ্ছা বার্তা প্রিন্ট করে:

source: Continuation lines are needed when entering a multi-line construct. As an example, take a look at this :keyword:`if` statement::
bn: একটি মাল্টি-লাইন নির্মাণে প্রবেশ করার সময় লাইনের ধারাবাহিকতা প্রয়োজন। উদাহরণ হিসেবে, এই : keyword`if` বিবৃতিটি দেখুন::

source: For more on interactive mode, see :ref:`tut-interac`.
bn: ইন্টারেক্টিভ মোড সম্পর্কে আরও জানতে, দেখুন :ref:`tut-interac`।

source: The Interpreter and Its Environment
bn: ইন্টারপ্রিটার এবং এর পরিবেশ

source: Source Code Encoding
bn: সোর্স কোড এনকোডিং

source: By default, Python source files are treated as encoded in UTF-8. In that encoding, characters of most languages in the world can be used simultaneously in string literals, identifiers and comments --- although the standard library only uses ASCII characters for identifiers, a convention that any portable code should follow. To display all these characters properly, your editor must recognize that the file is UTF-8, and it must use a font that supports all the characters in the file.
bn: ডিফল্টরূপে, পাইথন সোর্স ফাইলগুলিকে UTF-8-এ এনকোড করা হিসাবে বিবেচনা করা হয়। সেই এনকোডিং-এ, বিশ্বের বেশিরভাগ ভাষার অক্ষরগুলি স্ট্রিং লিটারেল, শনাক্তকারী এবং মন্তব্যগুলিতে একযোগে ব্যবহার করা যেতে পারে --- যদিও স্ট্যান্ডার্ড লাইব্রেরি শুধুমাত্র শনাক্তকারীদের জন্য ASCII অক্ষর ব্যবহার করে, একটি নিয়ম যা যেকোনো পোর্টেবল কোড অনুসরণ করা উচিত। এই সমস্ত অক্ষরগুলি সঠিকভাবে প্রদর্শন করতে, আপনার এডিটরকে অবশ্যই সনাক্ত করতে হবে যে ফাইলটি UTF-8, এবং এটি অবশ্যই একটি ফন্ট ব্যবহার করবে যা ফাইলের সমস্ত অক্ষর সমর্থন করে৷

source: To declare an encoding other than the default one, a special comment line should be added as the *first* line of the file. The syntax is as follows::
bn: ডিফল্ট ব্যতীত অন্য একটি এনকোডিং ঘোষণা করতে, ফাইলের *প্রথম* লাইন হিসাবে একটি বিশেষ মন্তব্য লাইন যোগ করা উচিত। সিনট্যাক্স নিম্নরূপ::

source: where *encoding* is one of the valid :mod:`codecs` supported by Python.
bn: যেখানে *এনকোডিং* একটি বৈধ :mod:`codecs` পাইথন দ্বারা সমর্থিত।

source: For example, to declare that Windows-1252 encoding is to be used, the first line of your source code file should be::
bn: উদাহরণস্বরূপ, ঘোষণা করতে যে Windows-1252 এনকোডিং ব্যবহার করা হবে, আপনার সোর্স কোড ফাইলের প্রথম লাইনটি হওয়া উচিত::

source: One exception to the *first line* rule is when the source code starts with a :ref:`UNIX "shebang" line <tut-scripts>`. In this case, the encoding declaration should be added as the second line of the file. For example::
bn: *প্রথম লাইন* নিয়মের একটি ব্যতিক্রম হল যখন উৎস কোডটি একটি :ref:`UNIX "shebang" লাইন <tut-scripts>` দিয়ে শুরু হয়। এই ক্ষেত্রে, এনকোডিং ঘোষণা ফাইলের দ্বিতীয় লাইন হিসাবে যোগ করা উচিত। উদাহরণ স্বরূপ::

source: Footnotes
bn: পাদটীকা (ফুটনোটস)

source: On Unix, the Python 3.x interpreter is by default not installed with the executable named ``python``, so that it does not conflict with a simultaneously installed Python 2.x executable.
bn: ইউনিক্সে, পাইথন 3.x ইন্টারপ্রেটার ডিফল্টরূপে ``পাইথন`` নামের এক্সিকিউটেবলের সাথে ইনস্টল করা হয় না, যাতে এটি একই সাথে ইনস্টল করা পাইথন 2.x এক্সিকিউটেবলের সাথে বিরোধ না করে।
